{"2chainz":{"definition":"Some crappy rapper from Georgia, trying to make it big - by riding Drake and Lil Wayne nutz.","time":1445791630461},"test":{"definition":"A process for testing things","time":1445791685693},"coward":{"definition":"noun<br /><br />1. One who is not brave<br />2. One who fears many things<br />3. The most insulting word known to man<br /><br />Synonyms:<br />1. [scaredy-cat]<br />2. [loser]<br />Antonyms:<br />1. [non-coward]<br />2. [hero]<br />3. [valiant warrior]<br />4. [Adventurer]<br />5. [Voorhees 2nd Floor]","time":1445791707818},"the":{"definition":"a common mispelling of [teh].","time":1445791742160},"bigbang":{"definition":"Korean boy band. Debuted in 2006.","time":1445791785659},"eos":{"definition":"Eos (Aurora) is the goddess of the dawn.","time":1445791790596},"extreme":{"definition":"A marketing ploy to make kids want to buy things with their parent&apos;s money.<br /><br />Stuff + X-TREME name + SHOUTING VOICES AND CAPITAL LETTERS = Kids&apos; moneys!!1!!","time":1445791804377},"vintro":{"definition":"A simple combination of [vintage] and [retro]. Can be used as a verb or adjective.","time":1445791852063},"pepe":{"definition":"The Most Powerfull being in the whloe universe after Chuck Norris, he&apos;s indestructible and invincible, some people think he is only a myth, but he&apos;s 100% Real","time":1445791920873},"puta":{"definition":"means whore or bitch in portuguese, spanish, and Filipino","time":1445792057181},"pene":{"definition":"Spanish for penis","time":1445792068196},"hijo":{"definition":"<br />n. (pronounced: ee-ho)<br /><br />1) Son<br />2) A n00b<br />3) A loveable and well-meaning no0b<br />See n00b entries 3 &amp; 4<br />","time":1445792076102},"hijodeputa":{"definition":"1. Spanish translation for &quot;son of a bitch&quot;<br />","time":1445792086868},"polla":{"definition":"Spanish slang for [cock]","time":1445792243409},"blowjob":{"definition":"When us young ladies put our mouth&apos;s on a guys cock and suck repeatedly until they reach orgasm. Giving a blowjob should not be looked upon as a chore, but as a pleasurable thing for both involved. Be sure to pay attention to the whole penis, not just the head. Swirl your tongue around the tip while pumping him with your fist or both, if you like. Lovingly message his balls and always deepthroat it. Alternate your speed when sucking a cock, showing your guy that him coming in your mouth is your top priority. And when he does start to come don&apos;t stop what you&apos;re doing, suck until he&apos;s done. And always swallow with a smile.","time":1445792252081},"deeznuts":{"definition":"1) A sarcastic expression used to denote annoyance or frustration.<br />2) A term used when you just dont give a fuck<br />3) Look, my dick and balls are bigger than yours.","time":1445793608802},"rainingmen":{"definition":"When you masturbate out an open window.","time":1445793661081},"snow":{"definition":"something that is radical, cool, or otherwise awesome. something that is snow is generally the shit, being top score, bitchin, etc. the word is derived from the fact that snow is generally off the hook in its beauty, power, and pimpery","time":1445794434587},"love":{"definition":"nature&apos;s way of tricking people into reproducing","time":1445890114282},"jara":{"definition":"Puerto Rican slang for the police, popular in the past (between the decades of the 40&apos;s-70&apos;s).  Comes from a play on the name O&apos;Hara in reference to Irish police officers who patrolled the cities.","time":1445894503654},"damn":{"definition":"The all purpose word.","time":1445894522731},"brasil":{"definition":"Best country in the world.<br />Nuff said.","time":1445895203926},"key":{"definition":"Kilogram, usually refering to narcotics.","time":1445895215504},"thearkofthecovenant":{"definition":"The Ark of the Covenant a.k.a. one of the most sacred gifts to mankind has been found in the form of a pictograph by of all people Michael Thomas Fazio from Howard Beach Queens New York and this we all know to be true.  Yes ladies and gentlemen and children of all ages, an exact replica of The Ark of the Covenant that which the Lord God gave Moses to guide the wandering Hebrews through the desert has been placed in the most highly publicized and distributed piece of artwork on the face of the planet Earth a.k.a. the entire Reverse of {{{~ONE DOLLAR BILL~}}}. Of course this piece of artwork fulfills every aspect of Deuteronomy chapter 32 verses one through seven.  This artwork is also the most complex piece of artwork ever created in the history of this world and is only discernible by those who can understand hieroglyphs, pictographs, ideograms, Mercator projection, and {{{ ~ Euclidean Optics ~ }}} because otherwise it simply looks like an obscure design.  Therefore Michael Fazio spent 35 years of his life doing research into pictographs, hieroglyphs and the study of {{{ ~ Euclidean Optics ~ }}} at which point at the age of 50 years started writing a book and on April 15, 2010 copyrighted that book and immediately created a website with a 439 picture shopping cart  @ www.AngelsontheArk.com","time":1445896746094},"no":{"definition":"The word that makes sex rape.","time":1445896982478},"yes":{"definition":"1) An affirmative answer to a question, the opposite of no.<br />2) An expletive shouted out during an orgasm.<br />3) A British [progressive rock] (or [art rock]) group known for their hits &quot;Roundabout&quot; and &quot;Owner of a Lonely Heart&quot;.<br />4) A brand of laundry detergent in the US.","time":1445897010977},"cowgirl":{"definition":"n. a sexual position (aka [cowgirl position]) in which the woman sits astride the man.","time":1445977466771},"pancake":{"definition":"Female breasts pressed against glass.","time":1445977533393},"kitten":{"definition":"a baby cat! sometimes they can&apos;t meow properly yet and they are sooo cute!","time":1445977551861},"starfox":{"definition":"The name of the first game to use the Super FX Chip and simple 3D graphics. Also the name of a strange Atari game not affiliated with the popular Nintendo franchise. The word Star Fox is now more commonly known as the name of the arwing-flying team of 6 members dedicated to the keeping of peace throughout the universe, and more specifically, the Lylat System.<br /><br />The Team consist of:<br />Fox McCloud: Son of one of the first team members, James McCloud, and obviously a fox. Occasionally hot-headed but quite calm and serious. He is the head of the team and unarguably its best fighter. He is the only one who rides in the other ehicles, such as the Landmaster and the Blue Marine<br /><br />Falco Lombardi: The most hot-headed of the team, Falco is quite an arrogant bird who fires off at the mouth at times. Although he seems to rag on Fox at times, he is pure at heart, and is an ace pilot.<br /><br />Slippy Toad: Well known for his ever changing voice and mechanical genius, this frog has gone from a deep Lylatian, to a high pitched teenage girl voice, to a garbled radio transmission and finally to a croaky and more suiting voice. Although some may find him annyoying he is the wheels of the team, his vehicles the key to their success.<br /><br />Peppy Hare: One of the actual members of the old Star Fox Team, who fought valiantly at James McCloud&apos;s side. Peppy is now an old rabbit, and has long since retired from the cockpit and dispense advice from the head of the Star Fox Dreadnaught-class mothership, the Great Fox. Previously quite a competent flyer, Peppy now seems to be reaching his twilight years, how long he has left is unknown.<br /><br />Krystal: The blue fox of the doomed planet Cerinia. Her first appearance was in the third game, Star Fox Adventures, where she starred as a simple damsel in distress. Since then she has spent a year becoming a akilled pilot. Aside from this she also has the extraordinary skill to speak telepathically and look inside other&apos;s minds.<br /><br />ROB the Robot: Since Star Fox 64 Rob has starred as the general helper of the team, Slippy has now infused much more personality into ROB since, and he is now considered a member of the team. ROB supplies various things for the team, such as Nova Bombs or Laser Upgrades, if a team member is in trouble you can always count on ROB to be there.<br /><br />The game features villains such as the popular Andross, Star Wolf, General Scales and the recent addition of the deadly Aparoids. The games are based around the adventures of the team, most of which involve rescuing planets and systems from impending doom. Players have the ability to control Fox, and have recently been able to jump from the Arwing or Landmaster cockpit and engage the enemy on foot with numerous weapons, a mystical staff, blaster, rocket launchers and snipers. The game franchise has come a long way, and despite those who oppose it, still has a long way to go, it will truly go down as a classic.","time":1445977605939},"spider":{"definition":"Scary ass creatures. O_O","time":1445977626704},"bone":{"definition":"1) (v) To have sexual intercourse. &quot;Your aim is to bone&quot; -- Tribe Called Quest (Classic example of a date rape).<br />2) (n) Penis. &quot;You can act like a doggy, and play with my bone&quot; -- Schoolly D. (Another poem [??]). 3) (n) One dollar.<br />3) (n) Core, soul. &quot;I&apos;m a rock hard trooper to the bone&quot; -- Public Enemy (Louder Than A Bomb)<br />4) (v) To bone out, as in leaving. &quot;They all got in the car and boned out&quot; -- Smokey (Friday [1995]).<br />5) (n) A joint. &quot;Smokin&apos; bones in the staircase&quot; -- Wu-Tang Clan (C.R.E.A.M. [1993]). <br />","time":1445977637578},"howard":{"definition":"A man with a large amount of [sex appeal], [intelligence] and [loyalty]. Usually fairly [good] at at sports, and often deeply [thoughtful] and [romantic].","time":1446079555725},"icicle":{"definition":"A common abdominal pain that can occur without warning. The term &quot;[icicle]&quot; is used because the pain can be described as if an icicle has been violently shoved into your rectum and has pierced through your internal organs, a very sharp and intense, yet quick pain. ","time":1446079573911},"ice":{"definition":"1)- Frozen water, used to cool drinks or for medical healing during athletic competition<br /><br />2)- Expensive jewelry, usually in the form of diamonds that is worn in either necklace, ring, chain, or earrings<br /><br />3)- To kill or murder someone<br /><br />4)- Methamphetamines, illicit street drugs","time":1446079608004},"baby":{"definition":"1.  Term of endearment, usually used by people having sexual intercourse with one another.<br /><br />2.  Exclamation, usually during sexual intercourse.<br /><br />3.  The direct consequence of sexual intercourse.","time":1446079630269},"cheese":{"definition":"The greatest substance known to man,Worshipped by pagans, exploited by me!","time":1446079657238},"food":{"definition":"a substance you eat,then poop out.usually followed my a nap.","time":1446079667331},"meal":{"definition":"Getting blowjobs from hott chicks, hot chicks in general, boning hot chicks, big party with lots of hot chicks.","time":1446079676097},"tacobell":{"definition":"a slow, delicious death.","time":1446079717500},"hell":{"definition":"A yellow bus carries me there every morning Monday through Friday.","time":1446079727063}}
